#+TITLE:       Linux/Unix Shell 二三事之过滤器grep
#+AUTHOR:      Samray
#+EMAIL:       samray@localhost.localdomain
#+DATE:        2017-03-13 Mon
#+URI:         /blog/%y/%m/%d/linux-unix-shell-二三事之过滤器grep
#+KEYWORDS:    shell,linux,grep
#+TAGS:        shell,linux
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: an introduction about grep

#+BEGIN_QUOTE
grep - print  lines matching a pattern
#+END_QUOTE
今天笔者想聊聊 *grep* 这个命令；据说，有Unix/Linux 的地方就会有 *grep*, 这个可能
是安装得最广泛的命令之一；那么 *grep* 是用来干什么的呢？grep 其实是用来在文件中
搜索特定内容或者模式的工具(配合正则表达式“食用”，味道更佳 :))现在就来一起看看
*grep* 的用法
** 基础用法
   现在假设有一个简单的文本文件(双城记开头)tinytale.txt,内容如下
   #+BEGIN_QUOTE
   it was the best of times it was the worst of times
   it was the age of wisdom it was age of foolishness
   it was the epoch of belief it was the epoch of incredulity
   it was the season of light it was the season of darkness
   IT WAS THE SPRING OF HOPE IT WAS THE WINTER OF DESPAIRE
   #+END_QUOTE
   现在开始介绍 *grep* 的基本用法： *grep* 的基本用法很简单的，假设笔者想要搜索
   单词 *darkness*
   #+BEGIN_SRC shell
     grep darkness /tmp/tinytale.txt
   #+END_SRC

   #+RESULTS:
   : it was the season of light it was the season of darkness

   输出如下：
   #+BEGIN_SRC 
 it was the season of light it was the season of darkness
   #+END_SRC
** 结合正则表达式
   默认情况下， *grep* 是开启正则表达式的模式的，所以你可以直接在文件搜索中使用
   正则表达式。现在在文件中搜索以字母 *e* 开头后接三个字符，然后以 *h* 结尾的单词：
   #+BEGIN_SRC shell
     grep "e...h" /tmp/tinytale.txt
   #+END_SRC

   #+RESULTS:
   : it was the epoch of belief it was the epoch of incredulity

   输出如下：
   #+BEGIN_QUOTE
   : it was the epoch of belief it was the epoch of incredulity
   #+END_QUOTE
   可以看到，正则表达式匹配了 *epoch* 这个单词。正则表达式的威力无与伦比的，把 *grep*
   和正则表达式结合起来可以更好地发挥 *grep* 这个工具的潜力；而本文主要是介绍 *grep*
   ,更多有关正则表达式的用法不细讲了
** 统计出现的次数
   有时，如果你需要统计某种模式或者某个单词出现的个数，你会发现 *grep* 非常有用；
   要实现该功能，只需给 *grep* 添加 *-c* 参数；例如统计单词 *the* 出现的个数：
   #+BEGIN_SRC  shell
     grep -c the /tmp/tinytale.txt
   #+END_SRC

   #+RESULTS:
   : 4
   结果输出如下：
   #+BEGIN_SRC 
4
   #+END_SRC
   文本中包含4个 *the*
** 忽略大小写 
   前面提到， *grep* 默认是使用正则表达式来搜索文件的，所以 *grep* 是区分大小写的；
   如果你想修改 *grep* 的默认行为来忽略大小写，你可以添加 *-i* 参数
   #+BEGIN_SRC shell
     grep -i the /tmp/tinytale.txt
   #+END_SRC

   #+RESULTS:
   | it | was | the | best   | of | times  | it | was | the | worst  | of          | times       |
   | it | was | the | age    | of | wisdom | it | was | age | of     | foolishness |             |
   | it | was | the | epoch  | of | belief | it | was | the | epoch  | of          | incredulity |
   | it | was | the | season | of | light  | it | was | the | season | of          | darkness    |
   | IT | WAS | THE | SPRING | OF | HOPE   | IT | WAS | THE | WINTER | OF          | DESPAIRE    |
   输出结果如下：
   #+BEGIN_SRC 
it was the best of times it was the worst of times
it was the age of wisdom it was age of foolishness
it was the epoch of belief it was the epoch of incredulity
it was the season of light it was the season of darkness
IT WAS THE SPRING OF HOPE IT WAS THE WINTER OF DESPAIRE
   #+END_SRC
   可以发现 *THE* 也是可以被 grep 搜索到的；但是如果没有添加 *-i* ,你只会看到4行输出。
   当然你可以在正则表达式里面添加忽略大小写的模式，只是直接添加 *-i* 会简单很多。
